
public class sms2pro1q1b {

	public static void main(String[] args) {
		int[] arr = new int[]{ 1,2,3,4,5,6,7,8,9,10 }; 
		int k=3;
		System.out.println(Search(arr,k));
	}
	
	public static int Search(int [] arr, int k) {
		if (arr[0]>k) {                              // <-----0(1)- -    לבדוק האם יש טעם להכנס למערך- נשען על זה שהוא ממוין-הבדיקה מתבצעת פעם אחת
			return -1;
		}
		
		if (arr[arr.length-1]<k) {                   // <-----0(1)- הבדיקה מתבצעת פעם אחת
			return -1;
		}
		
		//^since we're given a sorted array.
		int fi=0;                                   //   מונה- מצביע ששומר כמה פעמים בעצם עלינו בחזקת 2- ביצענו את ההכפלה ב-2
		for (int i=1; i<=arr.length; i=i*2) {       // <-----0(1)- התכנית נשענת על כך שהמערך ממוין ולכן מכפילה את האינדקסים כל פעם ב-2.
			  fi=fi+1;                              // מקסימום זמן ריצה: o(logn) ---> (n= array's length) based on 2
													//במקרה שכל המספרים במערך חוץ מהאחרון קטנים מהמספר המבוקש, כלומר הוא אינו קיים במערך,  זהו זמן הריצה הארוך ביותר.
			
			// Exponential growth: logn (n= array's length) based on 2
						
			if (arr[i]>k) {                         // ברגע שהגענו למצביע שבמקומו המערך גדול יותר מהמספר אוו אנו מחפשים, נעצור את גדילת האינדקסים ונחפש בעצם בכל המע
								                    //רך (חוץ מבמקוםהראשון אותו כבר בדקנו) עד אליו- כיוון שהוא ממוין, האיבר המבוקש, הקטן יותר, יימצא רק באיברים שלפניו.
				
				for (int m=i; m>=(int) Math.pow(2, fi); m--) {         // <--------- זמן ריצה:  קטן מ.. < O(log(i)) based on 2== log(m) based on 2 
																		//	m: מספר האיברים שלפני K / לפני האיבר הכי קרוב ל-K
																		//במקרה שהמספר המבוקש אכן נמצא במערך- זהו זמן הריצה שיתקבל.
																		// החיפוש ייערך בין האינדקס בו המערך יותר גדול מהאיבר המבוקש, וירד עד לאינדקס שביקרנו בו קודם על מנת לחפש- בעצם, עד 2 בחזקת המספר המונה הקודם fi
																		// שכן המצביע  i
																		// 2מתקבל בהצבת  * fi
																		// log(m)== O(log(i)והרי תחום איברים זה- בין 2 בחזקת המונה לבין האיי שלנו, הוא קטן שווה ל
																		// כיוון שבמקרה הגרוע ביותר האיי שלנו הוא 2 בחזקת המונה. במקרים האחרים, "חתכנו" בעצם בדיקת 2 בחזקת מונה פחות אחד איברים.
					if (arr[m]==k) {

						return m;
					}
					
				}
				
			}
			
			else {
				
				if (arr[i]==k) {

					return i;
					
				}
			}
				//else {
					//we have a case left-
					//meaning that (arr[i]<k)
					//keep going then. keep on searching farther.
				//}

		}
		return -1;
		
	}
}
